In [16]:
from rec_room.datasets import load_oms_courses_dataset, load_us_colleges_dataset
from rec_room import ROOT_DIR

from os.path import join

In [8]:
df = load_oms_courses_dataset().head()

In [9]:
df

  course_id                 course_name  rating  workload  difficulty
0   CS-6210  Advanced Operating Systems     5.0      20.0         5.0
1   CS-6210  Advanced Operating Systems     NaN      10.0         4.0
2   CS-6210  Advanced Operating Systems     5.0      15.0         4.0
3   CS-6210  Advanced Operating Systems     NaN      20.0         4.0
4   CS-6210  Advanced Operating Systems     4.0      25.0         5.0

In [10]:
df = df.dropna().reset_index(drop=True)

df.to_csv()

  course_id                 course_name  rating  workload  difficulty
0   CS-6210  Advanced Operating Systems     5.0      20.0         5.0
1   CS-6210  Advanced Operating Systems     5.0      15.0         4.0
2   CS-6210  Advanced Operating Systems     4.0      25.0         5.0

In [13]:
f = join(ROOT_DIR, 'datasets', 'data', 'oms_courses.csv')

In [15]:
df.to_csv(f)

In [4]:
load_us_colleges_dataset().head()

   gre   gpa  rank                                        name
0  700  3.65     2  University of Illinois at Urbana-Champaign
1  700  3.27     2           Washington University in St Louis
2  640  3.35     3                        Creighton University
3  600  3.47     2                     University of Wisconsin
4  700  4.00     1                          Harvard University